In [2]:
name =['viv','tit','sis','jojo','lk','ojas']
city = ['roorkee','dehradun','jammu','jammu','kashmir','delhi']
gender = ['m','m','m','m','m','m']

In [4]:
students_dict = {
    'Name' : name,
     'city' : city,
    "gender" : gender
}

In [6]:
import pandas as pd

In [7]:
data = pd.DataFrame(students_dict)

In [8]:
data

   Name      city gender
0   viv   roorkee      m
1   tit  dehradun      m
2   sis     jammu      m
3  jojo     jammu      m
4    lk   kashmir      m
5  ojas     delhi      m

In [10]:
data.head(2)

  Name      city gender
0  viv   roorkee      m
1  tit  dehradun      m

In [11]:
data.tail()

   Name      city gender
1   tit  dehradun      m
2   sis     jammu      m
3  jojo     jammu      m
4    lk   kashmir      m
5  ojas     delhi      m

In [12]:
data.tail(3)

   Name     city gender
3  jojo    jammu      m
4    lk  kashmir      m
5  ojas    delhi      m

In [16]:
data['Name']

0     viv
1     tit
2     sis
3    jojo
4      lk
5    ojas
Name: Name, dtype: object

In [17]:
data[['Name','city']]

   Name      city
0   viv   roorkee
1   tit  dehradun
2   sis     jammu
3  jojo     jammu
4    lk   kashmir
5  ojas     delhi

In [20]:
data['Name'][data['city']== 'jammu']

2     sis
3    jojo
Name: Name, dtype: object

In [ ]:
###data types:
#1. int64
#2. float64
#3. object
#4.bool